Yassine-Hattay/ESP32-security-system/src/main.cpp
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <ESPAsyncWebServer.h>
#include <espnow.h>
#include <SD.h>
#include "LittleFS.h" 
#include <NTPClient.h>
#include <TimeLib.h> // Include the TimeLib library 

#define BUFFER_SIZE 4096  
#define ESPNOW_CHANNEL 13

// WiFi credentials 
const char ssid[] = "Orange-066C";  
const char password[] = "GMA6ABLMG87"; 


// NTP settings
WiFiUDP udp;
NTPClient timeClient(udp, "pool.ntp.org", 3600, 3600000);  // Offset: UTC+1 (3600 seconds)

// File and async web server setup
File dir;
File file;
File root;
FSInfo fs_info;
char date[13] = "";

AsyncWebServer server(80);
bool connected_wifi;

uint16_t currentTransmitCurrentPosition = 0;
uint16_t currentTransmitTotalPackages = 0;
bool fileReceivingStarted = false; // Flag to check if receiving has started
bool fileTransmissionComplete = false; // Flag to check if transmission is complete
unsigned long startTime = 0; // Declare the startTime variable
bool moreFiles ;

void printMemoryAndFileSystemStats() {
  Serial.println("Memory and LittleFS Statistics:");
  // LittleFS Flash Information
  if (LittleFS.info(fs_info)) {
    Serial.printf("Total LittleFS Space: %u bytes\n", fs_info.totalBytes);
    Serial.printf("Used LittleFS Space: %u bytes\n", fs_info.usedBytes);
    Serial.printf("Free LittleFS Space: %u bytes\n", fs_info.totalBytes - fs_info.usedBytes);
  } else {
    Serial.println("Failed to retrieve LittleFS information.");
  }
    Serial.printf("Free RAM: %u bytes\n", ESP.getFreeHeap());

  
}

uint8_t getWiFiChannel(const char *ssid) {
  if (uint8_t n = WiFi.scanNetworks()) {
      for (uint8_t i=0; i<n; i++) {
          if (!strcmp(ssid, WiFi.SSID(i).c_str())) {
              return WiFi.channel(i);
          }
      }
  }
  return 0;
} 

// Initialize ESP-NOW
void InitESPNow() {
  if (esp_now_init() == 0) {
    Serial.println("ESPNow Initialized Successfully");
  } else {
    Serial.println("ESPNow Initialization Failed. Restarting...");
    ESP.restart();
  }
}
bool loadFileToLittleFS(const String &sourcePath, const String &destPath) {
  // Open SD file
  File sdFile = SD.open(sourcePath, "r");
  if (!sdFile) {
    Serial.println("Failed to open source file on SD card: " + sourcePath);
    return false;
  }

  // Create or open the file in LittleFS
  File littlefsFile = LittleFS.open(destPath, "w");
  if (!littlefsFile) {
    Serial.println("Failed to open destination file on LittleFS: " + destPath);
    sdFile.close();
    return false;
  }

  // Copy file from SD to LittleFS in chunks
  byte buffer[2048];
  while (sdFile.available()) {
    size_t bytesRead = sdFile.read(buffer, sizeof(buffer));
    littlefsFile.write(buffer, bytesRead);
    Serial.printf("Free RAM: %u bytes\n", ESP.getFreeHeap());
  }

  sdFile.close();
  littlefsFile.close();
  Serial.println("File successfully copied to LittleFS: " + destPath);
  return true;
}

void handleDatePhotos(AsyncWebServerRequest *request) {
    char url[20];

    LittleFS.format();

    strcpy(url, request->url().c_str());

    char* firstSlash = strchr(url + 1, '/');  // Find the first slash after the initial '/'

    if (firstSlash != nullptr && strlen(date) == 0) {
        firstSlash++;  // Move past the initial slash
        strcpy(date, firstSlash);  // Copy the substring into date

        // Remove trailing slash if present
        size_t len = strlen(date);
        while (len > 0 && date[len - 1] == '/') {
            date[len - 1] = '\0';  // Remove the last character (slash)
            len--;  // Decrease length to check the next character
        }

        // Remove leading slashes if present
        while (date[0] == '/') {
            // Shift all characters to the left by one (overwrite the first character)
            memmove(date, date + 1, strlen(date));
        }
    }

    char folderPath[21];  
    snprintf(folderPath, sizeof(folderPath), "/photos/%s", date);

    AsyncResponseStream *response = request->beginResponseStream("text/html");
    response->print("<!DOCTYPE html><html><head><title>Photos from ");
    response->print(date);
    response->print("</title><meta charset=\"UTF-8\"><meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0\"><style>");
    response->print("body{font-family:sans-serif;background:#f4f4f9;margin:0;padding:0;color:#333}h1{text-align:center;margin-top:20px;font-size:2.5rem;color:#333}p{text-align:center;margin:20px;color:#666}.gallery{display:flex;flex-wrap:wrap;justify-content:center;gap:20px;padding:20px}.gallery div{width:220px;height:auto;text-align:center;transition:transform 0.3s ease}.gallery div:hover{transform:scale(1.05)}.gallery img{width:100%;height:auto;border-radius:8px;object-fit:cover}.file-name{margin-top:10px;font-size:1rem;color:#333;padding:0 10px}.button{padding:12px 24px;font-size:1.2rem;border:none;border-radius:8px;background:#007BFF;color:white;cursor:pointer;margin-top:10px}.button:hover{background:#0056b3}.home-button{background:#28a745;position:fixed;top:20px;right:20px;border:none;border-radius:8px;padding:12px 24px;color:white;cursor:pointer;box-shadow:0 4px 8px rgba(0,0,0,0.1)}.home-button:hover{background:#218838}.home-button:disabled{background:gray;cursor:not-allowed}</style>");
    response->print("<script>");
    response->print("document.addEventListener('DOMContentLoaded', () => {");
    response->print("  const button = document.querySelector('.home-button');");
    response->print("  button.disabled = true;"); // Initially disable the button
    response->print("  setTimeout(() => {");
    response->print("    button.disabled = false;"); // Enable the button after 5 seconds
    response->print("  }, 5000);");
    response->print("});");
    response->print("function goHome() {");
    response->print("  const button = document.querySelector('.home-button');");
    response->print("  button.disabled = true;"); // Disable the button to prevent further clicks
    response->print("  button.innerText = 'Loading...';"); // Optionally update button text
    response->print("  fetch('/').then(r => r.text())");
    response->print("    .then(d => {");
    response->print("      document.body.innerHTML = d;"); // Replace the body content
    response->print("      window.location.href = '/';"); // Redirect the user to the root URL
    response->print("    })");
    response->print("    .catch(e => {");
    response->print("      console.error(e);");
    response->print("      button.disabled = false;"); // Re-enable button on error
    response->print("      button.innerText = 'Go Home';"); // Reset button text
    response->print("    });");
    response->print("}");
    response->print("</script></head><body>");
    response->print("<button class=\"home-button\" onclick=\"goHome()\">Go Home</button>");
    response->print("<h1>Photos from ");
    response->print(date);
    response->print("</h1><div class=\"gallery\">");

    uint8_t counter = 0;
    if (!moreFiles) {
        root = SD.open(folderPath); // Open the directory for scanning
    }

