Yassine-Hattay/ESP32-security-system/src/main.cpp
    if (root && root.isDirectory()) {
        if (!moreFiles) {
            dir = root.openNextFile();
        }
        moreFiles = false;

        while (dir) {
            if (!dir.isDirectory()) {
                char filePath[100];  // Ensure filePath is large enough

                const char* dirName = dir.name();  // Example directory name

                // Clear tempPath and filePath before using them
                memset(filePath, 0, sizeof(filePath));

                // Concatenate folderPath and dirName into tempPath
                snprintf(filePath, sizeof(filePath), "%s/%s", folderPath, dirName);

                // Check if the file ends with ".jpg"
                if (strlen(filePath) > 4 && strcmp(&filePath[strlen(filePath) - 4], ".jpg") == 0) {
                    counter++;

                    char littlefsPath[23];
                    snprintf(littlefsPath, sizeof(littlefsPath), "/moon_littlefs_%d.jpg", counter);

                    // Extract the file name without the extension
                    char fileName[100];  // Ensure fileName is large enough
                    // Copy the directory name to fileName
                    strncpy(fileName, dirName, sizeof(fileName) - 1);    

                    // Find the last occurrence of the period (.) character
                    char* dotPosition = strrchr(fileName, '.');

                    // If a dot is found and it's not the last character
                    if (dotPosition != NULL) {
                        *dotPosition = '\0';  // Terminate the string at the dot
                    }
                    // Check LittleFS space
                    LittleFS.info(fs_info);
                    unsigned long freeSpace = fs_info.totalBytes - fs_info.usedBytes;
                    if (freeSpace > 300000 && counter < 7) { 
                        // Only load the file if there's enough space
                        loadFileToLittleFS(filePath, littlefsPath);
                        for (int i = 0; fileName[i] != '\0'; i++) {
                                if (fileName[i] == '-') {
                                    fileName[i] = ':';  // Replace '-' with ':'
                                }
                            }      

                        response->print("<div>");
                        response->print("<div class=\"file-name\">");
                        response->print(fileName); // Display file name without extension
                        response->print("</div>");
                        response->print("<a href=\"");
                        response->print(littlefsPath);
                        response->print("\" target=\"_blank\">");
                        response->print("<img src=\"");
                        response->print(littlefsPath);
                        response->print("\" alt=\"");
                        response->print(fileName);
                        response->print("\"/></a>");
                        response->print("</div>");
                        }
                         
                     else {
                        moreFiles = true;
                        break; // Stop if there's not enough space for another file
                    }
                }
            }
            dir = root.openNextFile();
        }
    }

    response->print("</div>");

        if (moreFiles) {
            response->print("<div style=\"text-align: center; margin-top: 20px;\">");
            response->print("<p id=\"countdown\" style=\"font-size: 1.2rem; color: #555;\">Wait to download more photos in 5</p>");
            response->print("<button id=\"loadButton\" onclick=\"loadMorePhotos()\" disabled style=\"font-size: 1.2rem; padding: 12px 24px; border: none; border-radius: 10px; background-color: #28a745; color: white; cursor: not-allowed; transition: all 0.3s ease;\">Load More Photos</button>");
            response->print("</div>");
            response->print("<script>");
            response->print("let countdown = 5;");
            response->print("let countdownElement = document.getElementById('countdown');");
            response->print("let loadButton = document.getElementById('loadButton');");
            response->print("let interval = setInterval(function() {");
            response->print("  countdown--;"); 
            response->print("  countdownElement.textContent = 'Wait to download more photos in ' + countdown;");
            response->print("  if (countdown <= 0) {");
            response->print("    clearInterval(interval);");
            response->print("    countdownElement.textContent = 'You can now load more photos!';");
            response->print("    loadButton.disabled = false;");
            response->print("    loadButton.style.cursor = 'pointer';");  // Changes cursor to pointer when button is enabled
            response->print("  }");
            response->print("}, 1000);");

            response->print("function loadMorePhotos(){");
            response->print("  loadButton.disabled = true;"); // Disable the button after it's clicked
            response->print("  loadButton.style.cursor = 'not-allowed';"); // Change cursor to not-allowed
            response->print("  loadButton.textContent = 'Loading...';"); // Update button text immediately

            // Redirect to /more immediately after button click
            response->print("  window.location.href = '/more';"); // Redirect to '/more'

            response->print("}");
            response->print("</script>");
        }

    response->print("</body></html>");
    request->send(response);
    printMemoryAndFileSystemStats();
}

void handleHome(AsyncWebServerRequest *request) {

    LittleFS.format();
    moreFiles = false;
    date[0] = '\0';
    AsyncResponseStream *response = request->beginResponseStream("text/html");
    response->addHeader("Server", "ESP Async Web Server");

