Yassine-Hattay/ESP32-security-system/src/main.cpp
    // Start HTML document
    response->print(R"rawliteral(
    <!DOCTYPE html>
    <html>
    <head>
        <title>Select Date</title>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <style>
            body {
                font-family: 'Arial', sans-serif;
                background-color: #f4f4f9;
                color: #333;
                margin: 0;
                padding: 0;
                display: flex;
                flex-direction: column;
                align-items: center;
                justify-content: center;
                height: 100vh;
            }
            h1 {
                font-size: 2em;
                margin-bottom: 20px;
                color: #444;
                text-align: center;
            }
            .container {
                width: 90%;
                max-width: 600px;
                background: white;
                border-radius: 8px;
                box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
                padding: 20px;
                display: flex;
                flex-direction: column;
                align-items: center;
            }
            .date-list {
                list-style: none;
                padding: 0;
                margin: 0;
                text-align: center;
            }
            .date-list li {
                margin: 10px 0;
            }
            .date-list a {
                text-decoration: none;
                color: #007BFF;
                font-weight: bold;
                transition: color 0.3s ease;
            }
            .date-list a:hover {
                color: #0056b3;
            }
            .disabled {
                pointer-events: none;
                color: gray;
                cursor: not-allowed;
            }
            .top-right-button {
                position: absolute;
                top: 10px;
                right: 10px;
            }
            .top-right-button button {
                padding: 10px 20px;
                font-size: 16px;
                color: white;
                background-color: #e74c3c;
                border: none;
                border-radius: 5px;
                cursor: pointer;
                transition: background-color 0.3s ease;
            }
            .top-right-button button:disabled {
                background-color: gray;
                cursor: not-allowed;
            }
            .top-right-button button:hover {
                background-color: #c0392b;
            }
        </style>
        <script>
            function disableLinks(date) {
                // Disable all links
                var links = document.querySelectorAll('.date-list a');
                links.forEach(function(link) {
                    link.classList.add('disabled'); // Add disabled class
                    link.removeAttribute('href');  // Remove href to prevent navigation
                });
                // Change cursor to not-allowed
                document.body.style.cursor = 'not-allowed';

                // Redirect to the selected date's photo page
                window.location.href = '/photos/' + date;
            }
            function disableButton(button) {
                button.disabled = true; // Disable the button
            }
        </script>
    </head>
    <body>
        <div class="top-right-button">
            <button onclick="disableButton(this); window.location.href='/server_off';">
                Turn Off Server
            </button>
        </div>
        <div class="container">
            <h1>Available Dates for Photos</h1>
            <ul class="date-list">
)rawliteral");

    // Get the available dates by scanning SD card for folders
    File root_l = SD.open("/photos"); // Open the directory for scanning
    if (root_l && root_l.isDirectory()) {
        File dir_l = root_l.openNextFile();
        while (dir_l) { // Iterate through the directory
            if (dir_l.isDirectory()) {
                String date = dir_l.name();
                response->printf("<li><a href=\"#\" onclick=\"disableLinks('%s')\">%s</a></li>", date.c_str(), date.c_str());
            }
            dir_l = root_l.openNextFile();
        }
        dir_l.close();
    }

    root_l.close();
    dir.close();
    root.close();
    // Close HTML document
    response->print(R"rawliteral(
            </ul>
        </div>
    </body>
    </html>
    )rawliteral");

    request->send(response);
}





void OnDataRecv(uint8_t *mac_addr, uint8_t *data, uint8_t data_len) {
  static byte buffer[BUFFER_SIZE];  // Use larger buffer for faster data handling
  int bufferIndex = 0;
  
  String currentDate = String(year()) + "-" + String(month()) + "-" + String(day());
  String folderPath = "/photos/" + currentDate;

  switch (*data++) {
    case 0x01: // Start of file transmission
    { 
      if (!SD.exists(folderPath)) {
        if (SD.mkdir(folderPath)) {
          Serial.println("Folder created: " + folderPath);
        } else {
          Serial.println("Failed to create folder: " + folderPath);
        }
      } else {
        Serial.println("Folder already exists: " + folderPath);
      }

      currentTransmitCurrentPosition = 0; 
      currentTransmitTotalPackages = (*data++) << 8 | *data;

      // Get current time in hours and minutes for file naming
      String currentTime = String(hour()) + "-" + String(minute()) + "-" + String(second());
      // Open the file for writing with the current time in the filename
      file = SD.open(folderPath + "/" + currentTime + ".jpg", "w");
      if (!file) {
        Serial.println("Error opening file for writing!");
        return;
      }

      // Stop the server when file reception starts
      Serial.println("Server stopped to receive file.");

      // Record the start time of the transfer
      break;
    }
    case 0x02: // Data pack
    if(currentTransmitCurrentPosition == 0) {
      startTime = millis();
    }

