Yassine-Hattay/ESP32-security-system/src/main.cpp
    byte highByte = *data++;
    byte lowByte = *data++;
    currentTransmitCurrentPosition = (highByte << 8) | lowByte;

    // Store data in the buffer
    for (int i = 0; i < (data_len - 3); i++) {
      buffer[bufferIndex++] = *data++;  // Fill buffer with incoming data
      if (bufferIndex >= BUFFER_SIZE) {
        file.write(buffer, bufferIndex);
        Serial.printf("\n Buffer index: %d \n" ,bufferIndex) ;// Write buffer to file once full
        bufferIndex = 0; // Reset buffer index
      }
    }

    // Handle any remaining data in the buffer after the loop
    if (bufferIndex > 0) {
      file.write(buffer, bufferIndex);
      bufferIndex = 0; // Reset buffer
    }

    Serial.printf("Received packet %d of %d\n", currentTransmitCurrentPosition, currentTransmitTotalPackages);
    break;
  }

  if (currentTransmitCurrentPosition == currentTransmitTotalPackages) {
    Serial.printf("File transfer complete! Size: %d bytes\n", file.size());

    // Calculate the time taken for the transfer
    int transferTime = millis() - startTime;
    int transferTimeInSeconds = transferTime / 1000;  // Convert milliseconds to seconds
    Serial.printf("Total transfer time: %d seconds\n", transferTimeInSeconds);  // Print total time in seconds

    file.close();  // Close the file once the transfer is complete
    fileReceivingStarted = false;
    fileTransmissionComplete = false; // Reset flags for next transfer

  }
}
void server_end(AsyncWebServerRequest *request)
{
    AsyncResponseStream *response = request->beginResponseStream("text/plain");  // Set content type to plain text
    response->addHeader("Server", "ESP Async Web Server");

    // Send a simple OK response
    response->print("OK");

    request->send(response); // Send the response

    server.end(); // Stop the server
    WiFi.disconnect(); // Disconnect WiFi
    WiFi.mode(WIFI_STA); // Set WiFi mode to Station
    wifi_set_channel(ESPNOW_CHANNEL); // Set the WiFi channel
}


void setup_server()
{
  uint8_t counter = 0;
  while(counter < 6)
 {
  counter++;

  char littlefsPath[23];
  snprintf(littlefsPath, sizeof(littlefsPath), "/moon_littlefs_%d.jpg", counter);
  
  server.on(littlefsPath, HTTP_GET, [littlefsPath](AsyncWebServerRequest *req) {
                                req->send(LittleFS, littlefsPath, "image/jpeg");
                            });

 }
 
  server.on("/", HTTP_GET, handleHome); // Show home page
  server.on("/photos/*", HTTP_GET, handleDatePhotos); // Serve photo file
  server.on("/more", HTTP_GET, handleDatePhotos); // Serve photo file
  server.on("/server_off", HTTP_GET, server_end); // Serve photo file

 
  server.begin();
  return ;
  }

bool connectToWiFi(const char* ssid, const char* password, unsigned long timeout) {
  
  WiFi.begin(ssid, password); // Start connecting to WiFi
  Serial.print("Connecting to WiFi");

  unsigned long startTime = millis(); // Record the start time

  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");

    // Check if the timeout has been exceeded
    if (millis() - startTime >= timeout) {
      Serial.println("\nWiFi connection timeout.");
      return false; // Connection failed within the timeout
    }
  }

  
  Serial.println("\nWiFi connected!");

  setup_server();
  
  return true; // Successfully connected
}

void setup() {
  
  Serial.begin(115200);

  if (!LittleFS.begin()) {
    Serial.println("An Error has occurred while mounting LittleFS");
    return;
  }

  
  WiFi.mode(WIFI_AP);

  connected_wifi = connectToWiFi(ssid,password,10000);
  
  if(connected_wifi == false)
  {
  server.end(); // Stop the server
  WiFi.disconnect(); // Disconnect WiFi
  WiFi.mode(WIFI_STA); // Set WiFi mode to Station
  wifi_set_channel(ESPNOW_CHANNEL); // Set the WiFi channel 
     
    }  

  InitESPNow();
  esp_now_register_recv_cb(OnDataRecv);

  // Initialize SD card
  while(!SD.begin(D8)) {
    Serial.println("SD card initialization failed!");
    delay(100);
    Serial.println("Retrying!");
    SD.end();
  }

  Serial.println("SD card initialized successfully.");

  timeClient.begin(); 
   // Start NTP client to fetch time
  timeClient.update();
  unsigned long epochTime = timeClient.getEpochTime();
  setTime(epochTime); // Sets time for TimeLib functions

  timeClient.end();

  Serial.println("Async Web server initialized.");  
if (LittleFS.format()) {
  Serial.println("LittleFS formatted successfully!");
} else {
  Serial.println("Failed to format LittleFS!");
} 
  printMemoryAndFileSystemStats();
}

void loop() {
}
